/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */

"btn_pay" = "Оплатить";
"btn_submit" = "Представить";
"btn_next" = "Следующий";
"btn_skip" = "Skip";

"btn_send_sms" = "Отправить SMS";
"btn_resend_sms" = "Повторно отправить после \n%d сек.";

/* 界面 - JP 收银台 */
"navbar_checkout_title" = "Оплата";
"btn_checkout_agreement" = "Я согласился на соглашение JollyPay и сохранил эту карту для использования в будущем.";
"btn_checkout_agreement_highlight" = "соглашение JollyPay";

"label_checkout_completion_time" = "Заполните платеж в";

"cell_label_checkout_default_tips" = "Оплата с помощью дебетовой / кредитной карты";
"cell_label_checkout_default_change" = "Изменить";
"cell_label_checkout_discount" = "Скидка";

"cell_label_paymethod_balance" = "Balance";
"cell_label_paymethod_balance_left" = "Left";
"cell_label_paymethod_balance_invalid" = "Order amount exceeds available balance";

/* 界面 - 收银台加载异常 */
"label_loadingerror_inited_title" = "Ошибка инициализации";
"label_loadingerror_inited_detail" = "Вернитесь и повторите попытку.";
"btn_loadingerror_inited_operation" = "Попробуй еще раз";

"label_loadingerror_network_title" = "OOPS";
"label_loadingerror_network_detail" = "Проверьте подключение к сети";
"btn_loadingerror_network_operation" = "Попробуй еще раз";

"label_loadingerror_unusual_detail" = "Извините, ваша банковская карта заблокирована из-за неправильных действий на счете. Попробуйте другой способ оплаты.";
"btn_loadingerror_unusual_operation" = "Вернуться";

/* 界面 - 银行卡组件 */
"placeholder_bankpayment_card_number" = "Номер карты";
"placeholder_bankpayment_mmyy" = "Месяц/год ";
"placeholder_bankpayment_cvvcode" = "Код CVV";
"placeholder_bankpayment_card_holder_name" = "Имя на карте (необязательно)";

/* 界面 - 银行卡支付 */
"label_bankpayment_mada" = "This card is a Mada card.";

/* 界面 - 银行卡验证 */
"label_validcard_header_title" = "Обновите информацию о своей карте";
"label_validcard_header_description" = "Оплата в вашем аккаунте, которая используется %@ заканчивающийся в %@ году должны быть обновлены, чтобы завершить эту сделку.";
"btn_validcard_delete" = "Забыли или ударили? Удалить эту карту";
"btn_validcard_delete_highlight" = "Удалить эту карту";
"tips_validcard_delete" = "Если вы хотите удалить %@ %@, нажмите «Подтвердить».";

/* 界面 - SADAD 支付 */
"placeholder_sadad_account" = "Введите онлайн-оплаты ID　Алиас";
"btn_sadad_change" = "хотеть изменить его?";
"label_sadad_description" = "Пожалуйста, обратите внимание:\n1. Вы можете использовать САДАД практически со всеми саудовскими банками.\n2. Онлайн-платеж SADAD отличается от обычного SADAD. С помощью этого метода вам не нужен «Biller Code».\n\nЕсли у вас нет аккаунта SADAD?\nЭто не проблемы, выполните следующие действия и выполните платеж.\n\n1. Войдите в свой банковский счет и подпишитесь на службу SADAD.\n2. Введите свое имя пользователя SADAD, которое было создано ранее с вашим банковским счетом.\n3. Введите свой зарегистрированный пароль.\n4. Введите одноразовый пароль (OTP), отправленный на ваш мобильный телефон.\n5. Подтвердите и завершите платеж.";
"lable_sadad_title" = "Сумма к оплате";

/* 界面 - 绑定手机 */
"label_bindphone_title" = "Свяжите ваш номер телефона";
"label_bindphone_description" = "Для обеспечения безопасности вашего аккаунта, сначала укажите ваш номер телефона.";
"label_bindphone_region_title" = "Область";
"label_bindphone_region_value" = "Saudi Arabia";
"label_bindphone_note" = "Примечание: код подтверждения будет отправлен на мобильный телефон, когда вы произведете платеж с банковскими карточками в своем аккаунте. Убедитесь, что номер телефона принадлежит вам.";

/* 界面 - 选择手机国家码 */
"label_selectcountry_title" = "Пожалуйста выберите";

/* 界面 - 验证手机号 */
"label_validphone_title" = "Проверка SMS";
"label_validphone_description" = "Код подтверждения отправлен : ";
"placeholder_validphone_smscode" = "Код подтверждения";
"placeHolder_validphone_number" = "Мобильный номер";

/* 界面 - 支付密码设置 */
"label_setpassword_title" = "Установка платежного пароля";
"label_setpassword_description" = "Когда вы делаете платеж с банковскими картами в своем аккаунте, необходимо надо пароль платежа. Пожалуйста, предоставьте и запомните его .";
"label_resetpassword_title" = "Сброс платежного пароля";
"label_comfirmpassword_title" = "Подтвердить пароль для оплаты";
"label_setpassword_payment_title" = "Password Setting";
"label_couponinfo_description" = "%@ discount will be used for this transaction.";

/* 界面 - 快捷支付 */
"label_quickpayment_inputpwd_title" = "Введите пароль для оплаты";
"btn_quickpayment_inputpwd_forgot" = "Забыли пароль ?";
"label_quickpayment_inputsms_title" = "Проверка SMS";
"label_quickpayment_inputsms_description" = "Для сделки требуется подтверждение SMS. Код подтверждения отправлен на мобильный: ";

/* 界面 - 支付结果 */
"label_result_success_title" = "Завершено";
"label_result_success_detail" = "Платеж был успешным";

"label_result_pending_title" = "В ожидании/Обработка";
"label_result_pending_detail" = "Платеж ожидает обработки. Платеж продолжается.";

"label_result_error_title" = "ERROR";
"label_result_error_detail" = "Эта сделка не может быть завершена из-за недостаточного балан";

"label_result_oops_title" = "OOPS";
"label_result_oops_detail" = "the operation was declined  because the transaction had been completed";

/* 界面 - 用户协议 */
"navbar_agreement_title" = "Соглашение";

/* 界面 - 3DS 支付 */
"navbar_3ds_title" = "3D Secure Verification";

/* 界面 - 银行卡支付中绑卡 */
"label_payment_bindcard_note" = "To save this card, you must verify your mobile phone to set payment password";

/* 提示信息 */
"tips_action_ok" = "OK";
"tips_action_cancel" = "Отменить";
"tips_action_goto_setup" = "Перейти в настройки";
"tips_action_verify_sms" = "Проверить по SMS-коду";
"tips_action_retry" = "Попробуй еще раз";
"tips_action_confirm" = "Подтвердить";
"tips_action_enable" = "Enable";
"tips_action_enter_pwd" = "Enter password";

"tips_operation_success" = "В случае успешного";
"tips_operation_processing" = "Обработка";

"tips_network_timeout" = "Время истекло из-за системной ошибки.";
"tips_response_order_expired" = "Извините, срок действия заказа истек.";
"tips_response_error" = "Неизвестная ошибка. Невозможно четко определить причину проблемы. Пожалуйста, попробуйте еще раз";

"tips_checkout_setpwd" = "Пожалуйста, установите ваш платежный пароль перед оплатой";

"tips_title_invalid_pwd" = "Неверный пароль";
"tips_quickpaymentcode_invalid_twice" = "Неверный пароль. Вы можете попробовать еще раз или использовать проверочный код";
"tips_quickpaymentcode_invalid_once" = "Неверный пароль. Вы можете попробовать еще раз.";

"tips_sadad_invalid_account" = "SADAD аккаунт ID Alias псевдоним должен иметь буквенно-цифровые символы и специальные симвалы.";
"tips_sadad_length_account" = "SADAD аккаунт ID Alias псевдоним  должен иметь минимум 6 символов и максимум 12 символов";

/* 手机号校验 */
"tips_phone_invalid_length" = "Your mobile phone number should be %@ digits long";
"tips_phone_invalid_prefix" = "Your mobile phone number should start with %@";
"tips_phone_invalid" = "введите действительный номер мобильного телефона";

"tips_verification_sended" = "Код подтверждения отправлен на ваш мобильный телефон.";
"tips_verification_invalid" = "Введите действительный проверочный код";

"tips_password_warning_weak" = "пароль слишком слабый, повторите вводить.";
"tips_password_error_match" = "Два введенных пароля не совпадают.";

"tips_payment_bankcard_notsupported" = "К сожалению, мы не можем поддерживать эту карту";
"tips_currency_charged_description" = "You will be charged %@";

"tips_payment_timeout" = "Истекло время ожидания транзакции";

/* 生物验证 */
"tips_authid_enable_title" = "Enable Face/Touch Pay for JollyPay";
"tips_authid_allow_description" = "Please verify your %@";
"tips_authid_face" = "Face ID";
"tips_authid_touch" = "Touch ID";
"tips_authid_locked" = "Unlock your mobile phone";

/* 退出收银台 */
"tips_checkout_exit" = "Платеж не завершен, продолжить выйти?";

/* Session 失效 */
"response_msg_session_expired" = "Sorry, the session is expired.";
/* 营销系统 - 红包无效 */
"response_msg_coupon_invalid" = "Sorry, the coupon can not be used, please try again.";
/* 手机号 - 已被使用 */
"response_msg_phone_bind_used" = "The mobile phone has been used, please use a different mobile phone number.";
/* 验证码 - 发送失败 */
"response_msg_phone_sms_send_failure" = "Failed to send verification. Please try again.";
/* 验证码 - 手机号被锁 */
"response_msg_phone_sms_locked" = "Sorry, you have failed %@ times. The function will be locked for %@ mins.";
/* 支付 - 转汇查询超时 */
"response_msg_currency_timeout" = "Failed to query exchange rate. Tap to query again.";
/* 支付 - 币种不支持 */
"response_msg_currency_not_supported" = "Sorry, we can't support the currency";
/* 支付 - 预路由失败 */
"response_msg_payment_preouting_error" = "Unable To Route Transaction. Please try again.";
/* 支付 - 风控拦截 */
"response_msg_payment_intercepted" = "The transaction did not go through due to the order is in high risk.";
/* 支付 - 支付账号被锁 */
"response_msg_payment_account_locked" = "Sorry, you have failed multiple times. your account will be locked for %@ mins.";
/* 银行卡 - 绑卡超出范围 */
"response_msg_bankcard_bind_outrnage" = "Sorry, but you can only add %@ cards to your account.";
/* 银行卡 - 绑卡失败 */
"response_msg_bankcard_bind_failure" = "Failed to add bank card.";
/* 银行卡 - 重复绑卡 */
"response_msg_bankcard_bind_again" = "Bank card has been added. Please do not add it again.";
/* 银行卡 - 更新失败 */
"response_msg_bankcard_update_failure" = "Failed to update bank information.";
/* 银行卡 - 删除失败 */
"response_msg_bankcard_remove_failure" = "Failed to removed bank card. Please try again.";

// 原始
"payment_method_sadad" = "Sadad";
"payment_method_mada" = "Mada";
